## Staging: api_gateway
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_apigatewayv2_api.cra_upd_apigw_endpoint`            |
|        | `aws_apigatewayv2_integration.cra_upd_apigw_integration` |
|        | `aws_apigatewayv2_route.cra_upd_apigw_route`             |
|        | `aws_apigatewayv2_stage.cra_upd_apigw_stage`             |
|        | `aws_apigatewayv2_vpc_link.cra_upd_apigw_to_alb_vpclink` |
|        | `aws_security_group.cra_upd_apigw_vpclink_sg`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.cra_upd_apigw_endpoint will be created
  + resource "aws_apigatewayv2_api" "cra_upd_apigw_endpoint" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + disable_execute_api_endpoint = true
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "cra-upd-dashboard-apigw"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # aws_apigatewayv2_integration.cra_upd_apigw_integration will be created
  + resource "aws_apigatewayv2_integration" "cra_upd_apigw_integration" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ca-central-1:211125499457:listener/app/tf-lb-20250708175121374500000002/ab3232f5392ea35d/832c327368cf8611"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.cra_upd_apigw_route will be created
  + resource "aws_apigatewayv2_route" "cra_upd_apigw_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.cra_upd_apigw_stage will be created
  + resource "aws_apigatewayv2_stage" "cra_upd_apigw_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 1000
        }
    }

  # aws_apigatewayv2_vpc_link.cra_upd_apigw_to_alb_vpclink will be created
  + resource "aws_apigatewayv2_vpc_link" "cra_upd_apigw_to_alb_vpclink" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cra-upd-dashboard-apigw-to-alb-vpclink"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "subnet-03abf6f758a19e9a0",
        ]
      + tags_all           = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # aws_security_group.cra_upd_apigw_vpclink_sg will be created
  + resource "aws_security_group" "cra_upd_apigw_vpclink_sg" {
      + arn                    = (known after apply)
      + description            = "Security Group for API Gateway VPC Link"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow egress to the ECS load balancer from the API Gateway VPC Link"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b0666010b332b60e",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow ingress from the ECS load balancer to the API Gateway VPC Link"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b0666010b332b60e",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "cra-upd-dashboard-apigw-vpclink-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0fffaf0067d0706de"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + apigw_endpoint_domain = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_api.cra_upd_apigw_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_stage.cra_upd_apigw_stage"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_vpc_link.cra_upd_apigw_to_alb_vpclink"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_apigw_vpclink_sg"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
